tap 'cjbassi/ytop'
tap 'homebrew/cask-fonts'
tap 'microsoft/git'

# install packages
brew 'stow'
brew 'git'
brew 'node'
brew 'neovim'
brew 'luarocks'
brew 'neovim'
brew 'ripgrep'
brew 'fzf'
brew 'zsh'
brew 'node'
brew 'git'
brew 'nginx'
brew 'bat' # used by fzf previewer, uses its own theme
brew 'exa'
# brew 'yarn'
brew 'htop'
brew 'ytop'
brew 'ranger'
brew 'fnm'
brew 'python'
brew 'gh'

# tig
# brew 'gh'
# brew 'tmux'
# brew 'hub'
# brew 'fish'
# brew 'cjbassi/ytop/ytop'
# brew 'asciinema'
# brew 'youtube-dl'
# brew install bash-completion

# brew install docker-completion
# brew install docker-compose-completion
# brew install docker-machine-completion


# Casks
cask 'font-fantasque-sans-mono'
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-firacode-nerd-font'
cask 'font-jetbrainsmono-nerd-font'
cask 'git-credential-manager-core'
cask 'hammerspoon'
cask 'kitty'
cask 'java'
cask 'visual-studio-code'
cask 'datagrip'
cask 'webstorm'
cask 'spotify'

# cask 'docker'
# cask 'kindle'
# cask 'evernote'
# cask 'flux'
# cask 'calibre'
